# Report Analysis I

### Course Data Science [Alura](https://cursos.alura.com.br/course/introducao-python-pandas/)

## Import database

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("dados/aluguel.csv", sep=";")

In [3]:
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Bot창nico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higien처polis,1,0,0,48,800.0,230.0,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
Tipo          32960 non-null object
Bairro        32960 non-null object
Quartos       32960 non-null int64
Vagas         32960 non-null int64
Suites        32960 non-null int64
Area          32960 non-null int64
Valor         32943 non-null float64
Condominio    28867 non-null float64
IPTU          22723 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

## General info about the database

In [5]:
df.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [6]:
types_dates = pd.DataFrame(df.dtypes, columns = ['Types of the Dates'])

In [7]:
types_dates.columns.name = "Variables"

In [8]:
types_dates

Variables  Types of the Dates
Tipo                   object
Bairro                 object
Quartos                 int64
Vagas                   int64
Suites                  int64
Area                    int64
Valor                 float64
Condominio            float64
IPTU                  float64

In [9]:
 print("The database contain {} records (properties) and {} variables.".format(df.shape[0], df.shape[1]))

The database contain 32960 records (properties) and 9 variables.